MikroElektronika/core_packages/PIC/XC8/def/PIC16C925/mcu.h
// Register: LCDD05
#define LCDD05 LCDD05
extern volatile unsigned char           LCDD05              __at(0x115);
#ifndef _LIB_BUILD
asm("LCDD05 equ 0115h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG08                  :1;
        unsigned SEG09                  :1;
        unsigned SEG10                  :1;
        unsigned SEG11                  :1;
        unsigned SEG12                  :1;
        unsigned SEG13                  :1;
        unsigned SEG14                  :1;
        unsigned SEG15                  :1;
    };
} LCDD05bits_t;
extern volatile LCDD05bits_t LCDD05bits __at(0x115);
// bitfield macros
#define _LCDD05_SEG08_POSN                                  0x0
#define _LCDD05_SEG08_POSITION                              0x0
#define _LCDD05_SEG08_SIZE                                  0x1
#define _LCDD05_SEG08_LENGTH                                0x1
#define _LCDD05_SEG08_MASK                                  0x1
#define _LCDD05_SEG09_POSN                                  0x1
#define _LCDD05_SEG09_POSITION                              0x1
#define _LCDD05_SEG09_SIZE                                  0x1
#define _LCDD05_SEG09_LENGTH                                0x1
#define _LCDD05_SEG09_MASK                                  0x2
#define _LCDD05_SEG10_POSN                                  0x2
#define _LCDD05_SEG10_POSITION                              0x2
#define _LCDD05_SEG10_SIZE                                  0x1
#define _LCDD05_SEG10_LENGTH                                0x1
#define _LCDD05_SEG10_MASK                                  0x4
#define _LCDD05_SEG11_POSN                                  0x3
#define _LCDD05_SEG11_POSITION                              0x3
#define _LCDD05_SEG11_SIZE                                  0x1
#define _LCDD05_SEG11_LENGTH                                0x1
#define _LCDD05_SEG11_MASK                                  0x8
#define _LCDD05_SEG12_POSN                                  0x4
#define _LCDD05_SEG12_POSITION                              0x4
#define _LCDD05_SEG12_SIZE                                  0x1
#define _LCDD05_SEG12_LENGTH                                0x1
#define _LCDD05_SEG12_MASK                                  0x10
#define _LCDD05_SEG13_POSN                                  0x5
#define _LCDD05_SEG13_POSITION                              0x5
#define _LCDD05_SEG13_SIZE                                  0x1
#define _LCDD05_SEG13_LENGTH                                0x1
#define _LCDD05_SEG13_MASK                                  0x20
#define _LCDD05_SEG14_POSN                                  0x6
#define _LCDD05_SEG14_POSITION                              0x6
#define _LCDD05_SEG14_SIZE                                  0x1
#define _LCDD05_SEG14_LENGTH                                0x1
#define _LCDD05_SEG14_MASK                                  0x40
#define _LCDD05_SEG15_POSN                                  0x7
#define _LCDD05_SEG15_POSITION                              0x7
#define _LCDD05_SEG15_SIZE                                  0x1
#define _LCDD05_SEG15_LENGTH                                0x1
#define _LCDD05_SEG15_MASK                                  0x80

// Register: LCDD06
#define LCDD06 LCDD06
extern volatile unsigned char           LCDD06              __at(0x116);
#ifndef _LIB_BUILD
asm("LCDD06 equ 0116h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG16                  :1;
        unsigned SEG17                  :1;
        unsigned SEG18                  :1;
        unsigned SEG19                  :1;
        unsigned SEG20                  :1;
        unsigned SEG21                  :1;
        unsigned SEG22                  :1;
        unsigned SEG23                  :1;
    };
} LCDD06bits_t;
extern volatile LCDD06bits_t LCDD06bits __at(0x116);
// bitfield macros
#define _LCDD06_SEG16_POSN                                  0x0
#define _LCDD06_SEG16_POSITION                              0x0
#define _LCDD06_SEG16_SIZE                                  0x1
#define _LCDD06_SEG16_LENGTH                                0x1
#define _LCDD06_SEG16_MASK                                  0x1
#define _LCDD06_SEG17_POSN                                  0x1
#define _LCDD06_SEG17_POSITION                              0x1
#define _LCDD06_SEG17_SIZE                                  0x1
#define _LCDD06_SEG17_LENGTH                                0x1
#define _LCDD06_SEG17_MASK                                  0x2
#define _LCDD06_SEG18_POSN                                  0x2
#define _LCDD06_SEG18_POSITION                              0x2
#define _LCDD06_SEG18_SIZE                                  0x1
#define _LCDD06_SEG18_LENGTH                                0x1
#define _LCDD06_SEG18_MASK                                  0x4
#define _LCDD06_SEG19_POSN                                  0x3
#define _LCDD06_SEG19_POSITION                              0x3
#define _LCDD06_SEG19_SIZE                                  0x1
#define _LCDD06_SEG19_LENGTH                                0x1
#define _LCDD06_SEG19_MASK                                  0x8
#define _LCDD06_SEG20_POSN                                  0x4
#define _LCDD06_SEG20_POSITION                              0x4
#define _LCDD06_SEG20_SIZE                                  0x1
#define _LCDD06_SEG20_LENGTH                                0x1
#define _LCDD06_SEG20_MASK                                  0x10
#define _LCDD06_SEG21_POSN                                  0x5
#define _LCDD06_SEG21_POSITION                              0x5
#define _LCDD06_SEG21_SIZE                                  0x1
#define _LCDD06_SEG21_LENGTH                                0x1
#define _LCDD06_SEG21_MASK                                  0x20
#define _LCDD06_SEG22_POSN                                  0x6
#define _LCDD06_SEG22_POSITION                              0x6
#define _LCDD06_SEG22_SIZE                                  0x1
#define _LCDD06_SEG22_LENGTH                                0x1
#define _LCDD06_SEG22_MASK                                  0x40
#define _LCDD06_SEG23_POSN                                  0x7
#define _LCDD06_SEG23_POSITION                              0x7
#define _LCDD06_SEG23_SIZE                                  0x1
#define _LCDD06_SEG23_LENGTH                                0x1
#define _LCDD06_SEG23_MASK                                  0x80

