MikroElektronika/core_packages/PIC/XC8/def/PIC16C925/mcu.h
// Register: LCDD13
#define LCDD13 LCDD13
extern volatile unsigned char           LCDD13              __at(0x11D);
#ifndef _LIB_BUILD
asm("LCDD13 equ 011Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG08                  :1;
        unsigned SEG09                  :1;
        unsigned SEG10                  :1;
        unsigned SEG11                  :1;
        unsigned SEG12                  :1;
        unsigned SEG13                  :1;
        unsigned SEG14                  :1;
        unsigned SEG15                  :1;
    };
} LCDD13bits_t;
extern volatile LCDD13bits_t LCDD13bits __at(0x11D);
// bitfield macros
#define _LCDD13_SEG08_POSN                                  0x0
#define _LCDD13_SEG08_POSITION                              0x0
#define _LCDD13_SEG08_SIZE                                  0x1
#define _LCDD13_SEG08_LENGTH                                0x1
#define _LCDD13_SEG08_MASK                                  0x1
#define _LCDD13_SEG09_POSN                                  0x1
#define _LCDD13_SEG09_POSITION                              0x1
#define _LCDD13_SEG09_SIZE                                  0x1
#define _LCDD13_SEG09_LENGTH                                0x1
#define _LCDD13_SEG09_MASK                                  0x2
#define _LCDD13_SEG10_POSN                                  0x2
#define _LCDD13_SEG10_POSITION                              0x2
#define _LCDD13_SEG10_SIZE                                  0x1
#define _LCDD13_SEG10_LENGTH                                0x1
#define _LCDD13_SEG10_MASK                                  0x4
#define _LCDD13_SEG11_POSN                                  0x3
#define _LCDD13_SEG11_POSITION                              0x3
#define _LCDD13_SEG11_SIZE                                  0x1
#define _LCDD13_SEG11_LENGTH                                0x1
#define _LCDD13_SEG11_MASK                                  0x8
#define _LCDD13_SEG12_POSN                                  0x4
#define _LCDD13_SEG12_POSITION                              0x4
#define _LCDD13_SEG12_SIZE                                  0x1
#define _LCDD13_SEG12_LENGTH                                0x1
#define _LCDD13_SEG12_MASK                                  0x10
#define _LCDD13_SEG13_POSN                                  0x5
#define _LCDD13_SEG13_POSITION                              0x5
#define _LCDD13_SEG13_SIZE                                  0x1
#define _LCDD13_SEG13_LENGTH                                0x1
#define _LCDD13_SEG13_MASK                                  0x20
#define _LCDD13_SEG14_POSN                                  0x6
#define _LCDD13_SEG14_POSITION                              0x6
#define _LCDD13_SEG14_SIZE                                  0x1
#define _LCDD13_SEG14_LENGTH                                0x1
#define _LCDD13_SEG14_MASK                                  0x40
#define _LCDD13_SEG15_POSN                                  0x7
#define _LCDD13_SEG15_POSITION                              0x7
#define _LCDD13_SEG15_SIZE                                  0x1
#define _LCDD13_SEG15_LENGTH                                0x1
#define _LCDD13_SEG15_MASK                                  0x80

// Register: LCDD14
#define LCDD14 LCDD14
extern volatile unsigned char           LCDD14              __at(0x11E);
#ifndef _LIB_BUILD
asm("LCDD14 equ 011Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG16                  :1;
        unsigned SEG17                  :1;
        unsigned SEG18                  :1;
        unsigned SEG19                  :1;
        unsigned SEG20                  :1;
        unsigned SEG21                  :1;
        unsigned SEG22                  :1;
        unsigned SEG23                  :1;
    };
} LCDD14bits_t;
extern volatile LCDD14bits_t LCDD14bits __at(0x11E);
// bitfield macros
#define _LCDD14_SEG16_POSN                                  0x0
#define _LCDD14_SEG16_POSITION                              0x0
#define _LCDD14_SEG16_SIZE                                  0x1
#define _LCDD14_SEG16_LENGTH                                0x1
#define _LCDD14_SEG16_MASK                                  0x1
#define _LCDD14_SEG17_POSN                                  0x1
#define _LCDD14_SEG17_POSITION                              0x1
#define _LCDD14_SEG17_SIZE                                  0x1
#define _LCDD14_SEG17_LENGTH                                0x1
#define _LCDD14_SEG17_MASK                                  0x2
#define _LCDD14_SEG18_POSN                                  0x2
#define _LCDD14_SEG18_POSITION                              0x2
#define _LCDD14_SEG18_SIZE                                  0x1
#define _LCDD14_SEG18_LENGTH                                0x1
#define _LCDD14_SEG18_MASK                                  0x4
#define _LCDD14_SEG19_POSN                                  0x3
#define _LCDD14_SEG19_POSITION                              0x3
#define _LCDD14_SEG19_SIZE                                  0x1
#define _LCDD14_SEG19_LENGTH                                0x1
#define _LCDD14_SEG19_MASK                                  0x8
#define _LCDD14_SEG20_POSN                                  0x4
#define _LCDD14_SEG20_POSITION                              0x4
#define _LCDD14_SEG20_SIZE                                  0x1
#define _LCDD14_SEG20_LENGTH                                0x1
#define _LCDD14_SEG20_MASK                                  0x10
#define _LCDD14_SEG21_POSN                                  0x5
#define _LCDD14_SEG21_POSITION                              0x5
#define _LCDD14_SEG21_SIZE                                  0x1
#define _LCDD14_SEG21_LENGTH                                0x1
#define _LCDD14_SEG21_MASK                                  0x20
#define _LCDD14_SEG22_POSN                                  0x6
#define _LCDD14_SEG22_POSITION                              0x6
#define _LCDD14_SEG22_SIZE                                  0x1
#define _LCDD14_SEG22_LENGTH                                0x1
#define _LCDD14_SEG22_MASK                                  0x40
#define _LCDD14_SEG23_POSN                                  0x7
#define _LCDD14_SEG23_POSITION                              0x7
#define _LCDD14_SEG23_SIZE                                  0x1
#define _LCDD14_SEG23_LENGTH                                0x1
#define _LCDD14_SEG23_MASK                                  0x80

// Register: LCDD15
#define LCDD15 LCDD15
extern volatile unsigned char           LCDD15              __at(0x11F);
#ifndef _LIB_BUILD
asm("LCDD15 equ 011Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG24                  :1;
        unsigned SEG25                  :1;
        unsigned SEG26                  :1;
        unsigned SEG27                  :1;
        unsigned SEG28                  :1;
        unsigned SEG29                  :1;
        unsigned SEG30                  :1;
        unsigned SEG31                  :1;
    };
} LCDD15bits_t;
extern volatile LCDD15bits_t LCDD15bits __at(0x11F);
// bitfield macros
#define _LCDD15_SEG24_POSN                                  0x0
#define _LCDD15_SEG24_POSITION                              0x0
#define _LCDD15_SEG24_SIZE                                  0x1
#define _LCDD15_SEG24_LENGTH                                0x1
#define _LCDD15_SEG24_MASK                                  0x1
#define _LCDD15_SEG25_POSN                                  0x1
#define _LCDD15_SEG25_POSITION                              0x1
#define _LCDD15_SEG25_SIZE                                  0x1
#define _LCDD15_SEG25_LENGTH                                0x1
#define _LCDD15_SEG25_MASK                                  0x2
#define _LCDD15_SEG26_POSN                                  0x2
#define _LCDD15_SEG26_POSITION                              0x2
#define _LCDD15_SEG26_SIZE                                  0x1
#define _LCDD15_SEG26_LENGTH                                0x1
#define _LCDD15_SEG26_MASK                                  0x4
#define _LCDD15_SEG27_POSN                                  0x3
#define _LCDD15_SEG27_POSITION                              0x3
#define _LCDD15_SEG27_SIZE                                  0x1
#define _LCDD15_SEG27_LENGTH                                0x1
#define _LCDD15_SEG27_MASK                                  0x8
#define _LCDD15_SEG28_POSN                                  0x4
#define _LCDD15_SEG28_POSITION                              0x4
#define _LCDD15_SEG28_SIZE                                  0x1
#define _LCDD15_SEG28_LENGTH                                0x1
#define _LCDD15_SEG28_MASK                                  0x10
#define _LCDD15_SEG29_POSN                                  0x5
#define _LCDD15_SEG29_POSITION                              0x5
#define _LCDD15_SEG29_SIZE                                  0x1
#define _LCDD15_SEG29_LENGTH                                0x1
#define _LCDD15_SEG29_MASK                                  0x20
#define _LCDD15_SEG30_POSN                                  0x6
#define _LCDD15_SEG30_POSITION                              0x6
#define _LCDD15_SEG30_SIZE                                  0x1
#define _LCDD15_SEG30_LENGTH                                0x1
#define _LCDD15_SEG30_MASK                                  0x40
#define _LCDD15_SEG31_POSN                                  0x7
#define _LCDD15_SEG31_POSITION                              0x7
#define _LCDD15_SEG31_SIZE                                  0x1
#define _LCDD15_SEG31_LENGTH                                0x1
#define _LCDD15_SEG31_MASK                                  0x80

